<a href="https://colab.research.google.com/github/Leyre-24/hello-world-1/blob/main/ActividadFormativa_Equipo1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Actividad Formativa**
## Equipo 1 
## 16 febrero 2021

**4. Conectar Google Colab con Google Drive (mount,**

In [ ]:
#4
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

**5. Cada quien escriba en una celda de texto su matrícula y nombre.**

A01284430 Nemesio Navarro Arámbula

A01610296 Leyre Carpinteyro Palos

A01720402 Bárbara García Quiroga

A00828792 Freddy Sebastián Silva Culcay

A00572893 Diego Pérez Hernández

In [ ]:
#Librerias a utilizar
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline

**6. Importar la base de datos como “data frame”.**

In [ ]:
#6
#Cargamos los datos.
df=pd.read_csv('/content/drive/Shareddrives/Análisis de Ciencia de Datos/titanic.csv',low_memory=False);

**7. Verifica que el archivo cargado en Google Colab corresponde con el archivo csv, revisando los primeros y los últimos renglones del "data frame".**

In [ ]:
#7
#Verificamos los datos viendo las primeras y últimas 5 entradas
df.head

<bound method NDFrame.head of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

**8. Identifica cuáles variables son categóricas y cuáles numéricas. Muestra esta información en una celda de texto.**

In [ ]:
#8
#Verificamos qué tipo de datos tenemos en cada entrada del dataframe original.
pd.crosstab(df.dtypes.index,df.dtypes)

col_0        int64  float64  object
row_0
Age              0        1       0
Cabin            0        0       1
Embarked         0        0       1
Fare             0        1       0
Name             0        0       1
Parch            1        0       0
PassengerId      1        0       0
Pclass           1        0       0
Sex              0        0       1
SibSp            1        0       0
Survived         1        0       0
Ticket           0        0       1

##Con base en la tabla podemos ver que:
PassengerId:      Categórico \\
Survived:         Categórico \\
Pclass:           Categórico \\
Name:             Categórico \\
Sex:              Categórico \\
Age:              Numérico \\
SibSp:            Numérico \\
Parch:            Numérico \\
Ticket:           Categórico \\
Fare:             Numérico \\
Cabin:            Categórico \\
Embarked:         Categórico

In [ ]:
#Creamos una lista para los numéricos y una para los categóricos
numericData=['Age','SibSp','Parch','Fare']
categoricData=[column for column in list(df.columns) if not (column in numericData)]

**9. Revisen que hace la función columns(), info() y describe(). Expliquen en una celda texto lo que hace cada una de estas funciones y muestren la información generada.**

In [ ]:
#9
#Obtenemos las etiquetas de las columnas del dataframe
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

#df.columns
Nos permite acceder al atributo "columns" del dataframe, permitiéndonos ver el nombre de cada una de las columnas. \\

In [ ]:
#Nos permite conocer las entradas no nulas de cada columna del dataframe, así como los tipos de datos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#df.info()
Proporciona una descripción de las columnas, nos da un index, el nombre, el número de entradas no nulas que contienen, sus tipos de datos y la memoria utilizada.

In [ ]:
#Medidas Descriptivas
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

#df.describe()
La función describe() obtiene las medidas descriptivas de todos aquellos atributos que sean numéricos. Proporciona la estadística básica (media, mediana, cuartiles, etc.)

**10. De las variables categóricas indica cuantos valores diferentes se tiene por categoría. De las variables numéricas indica su valor promedio, mediana, mínimo y máximo.**

In [ ]:
#10
for column in categoricData:
  print(str(column)+': '+str(len(set(df[column])))+' entradas únicas.')

PassengerId: 891 entradas únicas.
Survived: 2 entradas únicas.
Pclass: 3 entradas únicas.
Name: 891 entradas únicas.
Sex: 2 entradas únicas.
Ticket: 681 entradas únicas.
Cabin: 148 entradas únicas.
Embarked: 4 entradas únicas.

In [ ]:
for column in numericData:
  print(column)
  print('Media:',np.mean(df[column].dropna()),'Mediana:',np.median(df[column].dropna()),'Mínimo:',np.min(df[column].dropna()),'Máximo:',np.max(df[column].dropna()))

NameError: ignored

**11. Indica cuánto es el total que se pagó sumando la tarifa de todos los pasajeros.**

In [ ]:
#11
#Vemos el pago total.
totalPayment=np.sum(df['Fare'])
print(totalPayment)

28693.9493

**12. Crear un subconjunto de los datos de los que sobrevivieron y otro de los que no sobrevivieron**

In [ ]:
#12
#Creamos subconjuntos entre sobrevivientes y no sobrevivientes.
survivers=df[df['Survived']==1]
nonSurvivers=df[df['Survived']==0]

**13. Mostrar los datos de 5 personas de las que sobrevivieron y de las que no sobrevivieron.**

In [ ]:
#13
#Mostramos algunos datos de cada grupo de personas.
survivers[0:5]

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [ ]:
nonSurvivers[0:5]

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]